app/controllers/columns_controller.rb

SELECT * FROM "tables" WHERE ("tables"."id" = 1)
---
  def index
    @table = Table.find(params[:table_id])

SELECT * FROM "columns" WHERE ("columns"."id" = 0)
---
  def show
    @column = Column.find(params[:id])

SELECT * FROM "columns" WHERE ("columns"."id" = 10)
---
  def edit
    @column = Column.find(params[:id])

SELECT * FROM "columns" WHERE ("columns"."id" = 10)
UPDATE "columns" SET "column_type" = 'Integer', "null" = 't' WHERE "id" = 10
---
  def update
    @column = Column.find(params[:id])
		@table = @column.table
		@database = @table.database
		db = Mysql.connect('localhost', 'root', 'root', @database.name)
		@database.issue_query(@database.user, @database.use_dbsql, db)
		@database.issue_query(@database.user, @table.alter_dbsql + ' ' + @column.rename_column(params[:column]['name']), db)

    respond_to do |format|
      if @column.update_attributes(params[:column])

SELECT * FROM "tables" WHERE ("tables"."id" = 2)
---
  def new
    @table = Table.find(params[:table_id])

SELECT * FROM "tables" WHERE ("tables"."id" = 2)
INSERT INTO "columns" ("name", "table_id", "column_type", "null") VALUES(NULL, 2, NULL, NULL)
---
  def create
    @table = Table.find(params[:column][:table_id])
    @column = @table.columns.build(params[:column])
		@database = @table.database

		if @column.save

SELECT * FROM "columns" WHERE ("columns"."id" = 6)
DELETE FROM "columns" WHERE "id" = 6
---
  def destroy
    @column = Column.find(params[:id])
		@table = @column.table
		@database = @table.database
		db = Mysql.connect('localhost', 'root', 'root', @database.name)
		@database.issue_query(@database.user, @database.use_dbsql, db)
		@database.issue_query(@database.user, @table.alter_dbsql + ' ' + @column.drop_dbsql, db)
    @column.destroy