app/controllers/databases_controller.rb

SELECT * FROM "databases"
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
SELECT * FROM "databases" WHERE ("databases"."user_id" IS NULL)
---
  def index
    @databases = Database.all
    current_user = UserSession.find
    user_id = current_user && current_user.record.id
		@user = User.find(:first, :conditions => {:id => user_id})
    @mydatabases = Database.find(:all, :conditions => {:user_id => user_id})

SELECT * FROM "databases" WHERE ("databases"."id" = 0)
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def show
    @database = Database.find(params[:id])
    @sharedwith = User.find(:all, :conditions)

SELECT * FROM "databases" WHERE ("databases"."id" = 1)
SELECT * FROM "users" WHERE ("users"."id" = '1') LIMIT 1
---
  def edit
    @database = Database.find(params[:id])
    @users = User.find(:all)

SELECT * FROM "databases" WHERE ("databases"."id" = 1)
UPDATE "databases" SET "name" = 'My Database IS AWESOME' WHERE "id" = 1
---
  def update
    @database = Database.find(params[:id])
		#We can't rename a database in mysql
    respond_to do |format|
      if @database.update_attributes(params[:database])

INSERT INTO "databases" ("name", "user_id") VALUES('Testing', 1)
---
  def create
    @database = Database.new(params[:database])
    @database.user = current_user
		@database.users = [current_user]
    respond_to do |format|
      if @database.save

SELECT * FROM "databases" WHERE ("databases"."id" = 4)
DELETE FROM "databases" WHERE "id" = 4
---
  def destroy
    @database = Database.find(params[:id])
		db = Mysql.connect('localhost', 'root', 'root', @database.name)
		@database.issue_query(@database.user, @database.drop_dbsql, db)
    @database.destroy