app/controllers/tables_controller.rb

SELECT * FROM "databases" WHERE ("databases"."id" = 5)
---
  def index
		@database = Database.find(params[:database_id])

SELECT * FROM "tables" WHERE ("tables"."id" = 0)
---
  def show
		# @database = Database.find(params[:database_id])
		@table = Table.find(params[:id])

SELECT * FROM "tables" WHERE ("tables"."id" = 1)
---
  def edit
    @table = Table.find(params[:id])

SELECT * FROM "tables" WHERE ("tables"."id" = 1)
UPDATE "tables" SET "name" = 'Dpick is Lazy' WHERE "id" = 1
---
  def update
    @table = Table.find(params[:id])
		@database = @table.database
		db = Mysql.connect('localhost', 'root', 'root', @database.name)
		@database.issue_query(@database.user, @database.use_dbsql, db)
		@database.issue_query(@database.user, @table.rename_table(params[:table]['name']), db)

    respond_to do |format|
      if @table.update_attributes(params[:table])

SELECT * FROM "databases" WHERE ("databases"."id" = 1)
---
  def new
    @database = Database.find(params[:database_id])

SELECT * FROM "databases" WHERE ("databases"."id" = 1)
INSERT INTO "tables" ("name", "database_id") VALUES('Table', 1)
---
  def create
		@database = Database.find(params[:table][:database_id])
		@table = @database.tables.build(params[:table])
		if @table.save

SELECT * FROM "tables" WHERE ("tables"."id" = 4)
SELECT * FROM "databases" WHERE ("databases"."id" = 5)
DELETE FROM "tables" WHERE "id" = 4
---
  def destroy
		@table = Table.find(params[:id])
		@database = Database.find(@table.database_id)
		db = Mysql.connect('localhost', 'root', 'root', @database.name)
		@database.issue_query(@database.user, @database.use_dbsql, db)
		@database.issue_query(@database.user, @table.drop_dbsql, db)
		@table.destroy