app/controllers/users_controller.rb

INSERT INTO "users" ("name", "crypted_password", "username", "password_salt", "persistence_token", "password") VALUES('Eric Stokes', 'cd7c2709c7099f2c84c75862a720fc85e024da77756857c49c5ee0f210806e91b62e8f7e4959b556f9a148f47778f9e10870e31ee7533d414a2e7e328a390451', 'fernferret', 'FOL4VSvemyWJz0IFBSPV', 'fbbcc7e9d793b8f0c39f23959462f2e2c7a73a7c14c0e443723a5e111e7ac6f6bd9e97882696b144ba08a38689198a86dc419bcfa46ce703cc358cc8f142c502', NULL)
---
  def create
    @user = User.new(params[:user])
    if @user.save